app/controllers/likes_controller.rb

SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "hotel_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["hotel_id", 1], ["created_at", "2018-09-10 13:25:33.046496"], ["updated_at", "2018-09-10 13:25:33.046496"]]
---
  def create
    hotel = Hotel.find(params[:hotel_id])
    user = User.find(params[:user_id])
    Like.create(user: user, hotel: hotel)

DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."hotel_id" = $2 LIMIT $3  [["user_id", 1], ["hotel_id", 41], ["LIMIT", 1]]
---
  def destroy
    Like.find_by(user_id: params[:user_id], hotel_id: params[:hotel_id]).destroy