app/controllers/users_controller.rb

  def login
    @user = User.find_or_create_by(name: params[:name])
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "sam"], ["created_at", "2018-09-12 09:06:26.513433"], ["updated_at", "2018-09-12 09:06:26.513433"]]
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "sam"], ["LIMIT", 1]]

  def wishListed
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]