app/models/user.rb

  def findLikedHotels
    id_array = Like.all.select{|like| like.user_id == self.id}.map{|like| like.hotel_id}
    id_array.map do |arr_id|
      Hotel.all.find{|hotel|hotel.id ==arr_id}
---
SELECT "hotels".* FROM "hotels"
SELECT "likes".* FROM "likes"